BugBotLab/bugbot-firmware/robot/sdkconfig.defaults
# BugBot robot, ESP32-P4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# console over the USB-C port (USB Serial/JTAG on the P4 is not brought out; use TinyUSB CDC)
CONFIG_ESP_CONSOLE_UART_NONE=y
